# -*- coding: utf-8 -*-

from rag_helpers import RAG_OpenSearch, EmbeddingModel

##############################################
#############      Pre-Process    ############
##############################################


############# SET EMBEDDING MODEL ############


em = EmbeddingModel(EmbeddingModel.BGE_M3)


############# INITIAL OPENSEARCH ############


HOST = 'localhost'
PORT = 9200
USERNAME = 'admin'
PASSWORD = '@PassWord.1234'

ros = RAG_OpenSearch()
ros.connect_vector_db(host=HOST, port=PORT, username=USERNAME, password=PASSWORD)
ros.set_embedding_model(em)



############# CREATE VECTOR SPACE ############


VEC_SPACE = 'rag_1'

ros.delete_vector_space(VEC_SPACE)
ros.create_vector_space(VEC_SPACE)


############# ADD MANY ITEMS and QUERY ############


data='''
มาตรา ๒๖  ห้ามมิให้บุคคลใดเปิดเผยข้อมูลข่าวสารที่ได้มาเนื่องจากการดำเนินการตามมาตรา ๒๕ เว้นแต่เป็นข้อมูลข่าวสารเกี่ยวกับการกระทำความผิดที่เป็นคดีพิเศษซึ่งได้รับอนุญาตตามมาตรา ๒๕ และเป็นการปฏิบัติตามอำนาจหน้าที่หรือตามกฎหมายหรือตามคำสั่งศาล
มาตรา ๒๗  ในกรณีจำเป็นและเพื่อประโยชน์ในการดำเนินการตามพระราชบัญญัตินี้ ให้อธิบดีหรือผู้ได้รับมอบหมายมีอำนาจให้บุคคลใด จัดทำเอกสารหรือหลักฐานใดขึ้นหรือเข้าไปแฝงตัวในองค์กรหรือกลุ่มคนใด เพื่อประโยชน์ในการสืบสวนสอบสวน  ทั้งนี้ ให้เป็นไปตามข้อบังคับที่อธิบดีกำหนด การจัดทำเอกสารหรือหลักฐานใด หรือการเข้าไปแฝงตัวในองค์กร หรือกลุ่มคนใดเพื่อประโยชน์ในการสืบสวนสอบสวนตามวรรคหนึ่ง ให้ถือว่าเป็นการกระทำโดยชอบ
มาตรา ๒๘  ให้พนักงานสอบสวนคดีพิเศษ มีอำนาจเก็บรักษาของกลางหรือมอบหมายให้ผู้อื่นเป็นผู้เก็บรักษา ในกรณีที่ของกลางนั้น ไม่เหมาะสมที่จะเก็บรักษา หรือเก็บรักษาไว้จะเป็นภาระแก่ทางราชการ ให้อธิบดีมีอำนาจสั่งให้นำของกลางนั้น ออกขายทอดตลาดหรือนำไปใช้ประโยชน์ของทางราชการ โดยอาจหักค่าใช้จ่ายได้  ทั้งนี้ ตามระเบียบที่กระทรวงยุติธรรมกำหนด
มาตรา ๒๙  เพื่อประโยชน์ในการปฏิบัติหน้าที่ตามพระราชบัญญัตินี้ ให้กรมสอบสวนคดีพิเศษได้รับยกเว้นไม่อยู่ภายใต้บังคับกฎหมายว่าด้วยอาวุธปืน เครื่องกระสุนปืน วัตถุระเบิด ดอกไม้เพลิง และสิ่งเทียมอาวุธปืน และกฎหมายว่าด้วยการควบคุมยุทธภัณฑ์เช่นเดียวกับราชการทหารและตำรวจตามกฎหมายดังกล่าว  ทั้งนี้ การมีและใช้อาวุธปืน เครื่องกระสุนปืน วัตถุระเบิด ดอกไม้เพลิง สิ่งเทียมอาวุธปืน และยุทธภัณฑ์ ให้เป็นไปตามระเบียบที่กระทรวงยุติธรรมกำหนด
มาตรา ๓๐  ในการสืบสวนและสอบสวนคดีพิเศษคดีใดมีเหตุจำเป็นต้องใช้ความรู้ความเชี่ยวชาญเฉพาะด้านเป็นพิเศษ อธิบดีอาจแต่งตั้งบุคคลซึ่งมีความรู้ความเชี่ยวชาญในด้านนั้นเป็นที่ปรึกษาคดีพิเศษได้ ให้ที่ปรึกษาคดีพิเศษได้รับค่าตอบแทนตามที่กำหนดในระเบียบของกระทรวงยุติธรรมโดยความเห็นชอบของกระทรวงการคลัง
มาตรา ๓๑  ค่าใช้จ่ายสำหรับการสืบสวนและสอบสวนคดีพิเศษและวิธีการเบิกเงินทดรองจ่ายให้เป็นไปตามระเบียบกระทรวงยุติธรรม โดยได้รับความเห็นชอบจากกระทรวงการคลัง
มาตรา ๓๒  ในกรณีที่ กคพ. เห็นว่า เพื่อประสิทธิภาพในการปราบปรามการกระทำความผิดคดีพิเศษ กคพ. จะให้ความเห็นชอบให้คดีพิเศษคดีหนึ่งคดีใดหรือคดีประเภทใดต้องมีพนักงานอัยการหรืออัยการทหาร แล้วแต่กรณี มาสอบสวนร่วมกับพนักงานสอบสวนคดีพิเศษหรือมาปฏิบัติหน้าที่ร่วมกับพนักงานสอบสวนคดีพิเศษเพื่อให้คำแนะนำและตรวจสอบพยานหลักฐานตั้งแต่ชั้นเริ่มการสอบสวน แล้วแต่กรณี ก็ได้ เว้นแต่การสอบสวนคดีพิเศษที่มีลักษณะอย่างหนึ่งอย่างใดตามมาตรา ๒๑ วรรคหนึ่ง (๑) (ค) หรือ (ง) ต้องมีพนักงานอัยการหรืออัยการทหารมาสอบสวนร่วมกับพนักงานสอบสวนคดีพิเศษทุกคดี แล้วแต่กรณี  ทั้งนี้ การสอบสวนร่วมกันหรือการปฏิบัติหน้าที่ร่วมกันดังกล่าวให้เป็นไปตามหลักเกณฑ์และวิธีการที่ กคพ. กำหนด
มาตรา ๓๓  ในกรณีที่มีความจำเป็นเพื่อประโยชน์ในการสืบสวนและสอบสวนคดีพิเศษเรื่องใดเรื่องหนึ่งโดยเฉพาะ รัฐมนตรีอาจเสนอให้นายกรัฐมนตรีในฐานะหัวหน้ารัฐบาลมีคำสั่งตามกฎหมายว่าด้วยระเบียบบริหารราชการแผ่นดินให้เจ้าหน้าที่ของรัฐในหน่วยงานอื่นมาปฏิบัติหน้าที่ในกรมสอบสวนคดีพิเศษเพื่อช่วยเหลือในการสืบสวนและสอบสวนคดีพิเศษนั้นได้ ให้เจ้าหน้าที่ของรัฐตามวรรคหนึ่งเป็นพนักงานสอบสวนคดีพิเศษหรือเจ้าหน้าที่คดีพิเศษ สำหรับการสืบสวนและสอบสวนคดีพิเศษที่ได้รับการแต่งตั้ง
มาตรา ๓๔  ในกรณีที่พนักงานอัยการหรืออัยการทหาร แล้วแต่กรณี มีคำสั่งไม่ฟ้องคดีซึ่งได้สอบสวนโดยพนักงานสอบสวนคดีพิเศษ ให้การทำความเห็นแย้งตามมาตรา ๑๔๕ แห่งประมวลกฎหมายวิธีพิจารณาความอาญาหรือกฎหมายเกี่ยวกับวิธีพิจารณาความอาญาอื่นเป็นอำนาจหน้าที่ของอธิบดีหรือผู้ดำรงตำแหน่งอื่นตามที่กำหนดในกฎกระทรวง
'''

chunks = data.split('\n')

items = [{'doc':'พระราชบัญญัติ การสอบสวนคดีพิเศษ 2547', 'text': x} for x in chunks]


ros.store_many_items(VEC_SPACE, items)

